var W1 = 'рубль';
var W2 = 'рубля';
var W3 = 'рублей';

QUnit.test('IntToWords1', function (assert) {
	var data = [
		[null, null, ''],
		[undefined, null, ''],
		[[], null, ''],
		[{}, null, ''],
		[' ', null, ''],
		['abc', null, ''],
		['1-', null, ''],
		// ----
		[0, null, 'ноль'],
		[0., null, 'ноль'],
		[0.0, null, 'ноль'],
		[0.1, null, ''],
		[1, null, 'один'],
		[1., null, 'один'],
		[1.0, null, 'один'],
		[1.1, null, ''],
		[.0, null, 'ноль'],
		[.1, null, ''],
		// ----
		['0', null, 'ноль'],
		['0.', null, ''],
		['0.0', null, ''],
		['0.1', null, ''],
		['1', null, 'один'],
		['1.', null, ''],
		['1.0', null, ''],
		['1.1', null, ''],
		['.0', null, ''],
		['.1', null, ''],
		// ----
		[1, [W1], 'один'],
		[1, [W1, W2], 'один'],
		[1, {1: W1, 2: W2, 3: W3}, 'один'],
		['1.1', [W1, W2, W3], '']
	];
	for (var i in data) {
		assert.ok(intToWords(data[i][0], data[i][1]) === data[i][2], data[i][0]);
	}
});

QUnit.test('IntToWords2', function (assert) {
	var data = [
		[0, 'ноль', W3],
		[00, 'ноль', W3],
		[000, 'ноль', W3],
		[0000, 'ноль', W3],
		['0', 'ноль', W3],
		['00', 'ноль', W3],
		['000', 'ноль', W3],
		['0000', 'ноль', W3],
		// ----
		[1, 'один', W1],
		[2, 'два', W2],
		[3, 'три', W2],
		[4, 'четыре', W2],
		[5, 'пять', W3],
		[6, 'шесть', W3],
		[7, 'семь', W3],
		[8, 'восемь', W3],
		[9, 'девять', W3],
		[10, 'десять', W3],
		[11, 'одиннадцать', W3],
		[12, 'двенадцать', W3],
		[13, 'тринадцать', W3],
		[14, 'четырнадцать', W3],
		[15, 'пятнадцать', W3],
		[16, 'шестнадцать', W3],
		[17, 'семнадцать', W3],
		[18, 'восемнадцать', W3],
		[19, 'девятнадцать', W3],
		[20, 'двадцать', W3],
		[21, 'двадцать один', W1],
		[22, 'двадцать два', W2],
		[23, 'двадцать три', W2],
		[24, 'двадцать четыре', W2],
		[25, 'двадцать пять', W3],
		// ----
		[30, 'тридцать', W3],
		[40, 'сорок', W3],
		[50, 'пятьдесят', W3],
		[60, 'шестьдесят', W3],
		[70, 'семьдесят', W3],
		[80, 'восемьдесят', W3],
		[90, 'девяносто', W3],
		// ----
		[100, 'сто', W3],
		[200, 'двести', W3],
		[300, 'триста', W3],
		[400, 'четыреста', W3],
		[500, 'пятьсот', W3],
		[600, 'шестьсот', W3],
		[700, 'семьсот', W3],
		[800, 'восемьсот', W3],
		[900, 'девятьсот', W3],
		// ----
		[101, 'сто один', W1],
		[102, 'сто два', W2],
		[103, 'сто три', W2],
		[104, 'сто четыре', W2],
		[105, 'сто пять', W3],
		[106, 'сто шесть', W3],
		[107, 'сто семь', W3],
		[108, 'сто восемь', W3],
		[109, 'сто девять', W3],
		[110, 'сто десять', W3],
		[111, 'сто одиннадцать', W3],
		[112, 'сто двенадцать', W3],
		[113, 'сто тринадцать', W3],
		[114, 'сто четырнадцать', W3],
		[115, 'сто пятнадцать', W3],
		[116, 'сто шестнадцать', W3],
		[117, 'сто семнадцать', W3],
		[118, 'сто восемнадцать', W3],
		[119, 'сто девятнадцать', W3],
		[120, 'сто двадцать', W3],
		[121, 'сто двадцать один', W1],
		[122, 'сто двадцать два', W2],
		[123, 'сто двадцать три', W2],
		[124, 'сто двадцать четыре', W2],
		[125, 'сто двадцать пять', W3],
		// ----
		[1101, 'одна тысяча сто один', W1],
		[2102, 'две тысячи сто два', W2],
		[3103, 'три тысячи сто три', W2],
		[4104, 'четыре тысячи сто четыре', W2],
		[5105, 'пять тысяч сто пять', W3],
		// ----
		[1001101, 'один миллион одна тысяча сто один', W1],
		[2002102, 'два миллиона две тысячи сто два', W2],
		[3003103, 'три миллиона три тысячи сто три', W2],
		[4004104, 'четыре миллиона четыре тысячи сто четыре', W2],
		[5005105, 'пять миллионов пять тысяч сто пять', W3],
		// ----
		[1001001101, 'один миллиард один миллион одна тысяча сто один', W1],
		[2002002102, 'два миллиарда два миллиона две тысячи сто два', W2],
		[3003003103, 'три миллиарда три миллиона три тысячи сто три', W2],
		[4004004104, 'четыре миллиарда четыре миллиона четыре тысячи сто четыре', W2],
		[5005005105, 'пять миллиардов пять миллионов пять тысяч сто пять', W3],
		// ----
		['1000000000001', 'один триллион один', W1],
		['2000000000002', 'два триллиона два', W2],
		['3000000000003', 'три триллиона три', W2],
		['4000000000004', 'четыре триллиона четыре', W2],
		['5000000000005', 'пять триллионов пять', W3],
		// ----
		['1000000000000001', 'один квадриллион один', W1],
		['2000000000000002', 'два квадриллиона два', W2],
		['3000000000000003', 'три квадриллиона три', W2],
		['4000000000000004', 'четыре квадриллиона четыре', W2],
		['5000000000000005', 'пять квадриллионов пять', W3],
		// ----
		['1000000000000000001', 'один квинтиллион один', W1],
		['2000000000000000002', 'два квинтиллиона два', W2],
		['3000000000000000003', 'три квинтиллиона три', W2],
		['4000000000000000004', 'четыре квинтиллиона четыре', W2],
		['5000000000000000005', 'пять квинтиллионов пять', W3],
		// ----
		['1000000000000000000001', 'один секстиллион один', W1],
		['2000000000000000000002', 'два секстиллиона два', W2],
		['3000000000000000000003', 'три секстиллиона три', W2],
		['4000000000000000000004', 'четыре секстиллиона четыре', W2],
		['5000000000000000000005', 'пять секстиллионов пять', W3],
		// ----
		['1000000000000000000000001', 'один септиллион один', W1],
		['2000000000000000000000002', 'два септиллиона два', W2],
		['3000000000000000000000003', 'три септиллиона три', W2],
		['4000000000000000000000004', 'четыре септиллиона четыре', W2],
		['5000000000000000000000005', 'пять септиллионов пять', W3],
		// ----
		['1000000000000000000000000001', 'один октиллион один', W1],
		['2000000000000000000000000002', 'два октиллиона два', W2],
		['3000000000000000000000000003', 'три октиллиона три', W2],
		['4000000000000000000000000004', 'четыре октиллиона четыре', W2],
		['5000000000000000000000000005', 'пять октиллионов пять', W3],
		// ----
		['1000000000000000000000000000001', 'один нониллион один', W1],
		['2000000000000000000000000000002', 'два нониллиона два', W2],
		['3000000000000000000000000000003', 'три нониллиона три', W2],
		['4000000000000000000000000000004', 'четыре нониллиона четыре', W2],
		['5000000000000000000000000000005', 'пять нониллионов пять', W3],
		// ----
		['1000000000000000000000000000000001', 'один дециллион один', W1],
		['2000000000000000000000000000000002', 'два дециллиона два', W2],
		['3000000000000000000000000000000003', 'три дециллиона три', W2],
		['4000000000000000000000000000000004', 'четыре дециллиона четыре', W2],
		['5000000000000000000000000000000005', 'пять дециллионов пять', W3],
		// ----
		['1000000000000000000000000000000000001', 'один {неизвестно} один', W1],
		['2000000000000000000000000000000000002', 'два {неизвестно} два', W2],
		['3000000000000000000000000000000000003', 'три {неизвестно} три', W2],
		['4000000000000000000000000000000000004', 'четыре {неизвестно} четыре', W2],
		['5000000000000000000000000000000000005', 'пять {неизвестно} пять', W3]
	];
	for (var i in data) {
		assert.ok(intToWords(data[i][0], [W1, W2, W3]) === (data[i][1] + ' ' + data[i][2]), data[i][0]);
	}
});